app/controllers/contacts_controller.rb

  def edit

    user = current_user
    phonebook = current_user.phonebook
    @contact = phonebook.contacts.find(params[:id])
---
SELECT * FROM "contacts" WHERE ("contacts"."id" = '7') AND ("contacts".phonebook_id = 1) LIMIT 1
SELECT * FROM "phonebooks" WHERE ("phonebooks".user_id = 10) LIMIT 1

  def update
    #redirect_to  phonebook_path
    @contact = Contact.find(params[:id])
    if @contact.update_attributes(params[:contact])
---
SELECT * FROM "contacts" WHERE ("contacts"."id" = 7)
UPDATE "contacts" SET "fb" = 'raman1234', "updated_at" = '2015-02-04 05:42:15', "google_plus" = 'raman1234', "github" = 'raman1234', "twitter" = 'raman1234' WHERE "id" = 52

  def destroy
   user = current_user
    phonebook = current_user.phonebook
    @contact = phonebook.contacts.find(params[:id])
    @contact.destroy
---
SELECT * FROM "contacts" WHERE ("contacts"."id" = 7 AND ("contacts".phonebook_id = 1))
SELECT * FROM "phonebooks" WHERE ("phonebooks".user_id = 10) LIMIT 1
DELETE FROM "contacts" WHERE "id" = 7