app/controllers/contacts_controller.rb

  def create
  	params = params()
  	user = current_user
  	phonebook = current_user.phonebook
  	contact = phonebook.contacts.create!(:name=>"#{params[:contact][:name]}")
  	contact.mobiles.create!(:details => "#{params[:contact][:mobiles]}")
  	contact.emails.create!(:address => "#{params[:contact][:emails]}")
---
INSERT INTO "contacts" ("phonebook_id", "updated_at", "github", "created_at", "google_plus", "fb", "name", "twitter") VALUES(1, '2015-02-03 12:01:38', NULL, '2015-02-03 12:01:38', NULL, 'pranav0073', 'P Prashnat', 'pp1')
INSERT INTO "mobiles" ("created_at", "contact_id", "mtype", "details", "updated_at") VALUES('2015-02-02 07:34:21', 39, 'WORK', '06122311142', '2015-02-02 07:34:21')
INSERT INTO "emails" ("address", "contact_id", "updated_at", "created_at") VALUES('sharam.abishek@gmail.com', 50, '2015-02-03 12:35:59', '2015-02-03 12:35:59')