app/controllers/phonebooks_controller.rb

SELECT * FROM "contacts" WHERE ("contacts"."id" = '1') AND ("contacts".phonebook_id = 1) LIMIT 1
SELECT * FROM "phonebooks" WHERE ("phonebooks".user_id = 10) LIMIT 1
---
  def show
  	@phonebook = current_user.phonebook
  	@contact = @phonebook.contacts.find_by_id(params[:id])