app/controllers/users_controller.rb

  def create
  	@user = User.new(params[:user])
  	if @user.save
  		sign_in @user
  		flash[:success] = "Welcome to the Sample App!"
      #User.find(params[:id])
      user = User.last
      user.create_phonebook(:name => "#{user[:name]}'s Phonebook" )
---
INSERT INTO "users" ("updated_at", "salt", "email", "created_at", "encrypted_password", "name", "remember_token") VALUES('2015-01-28 15:17:29', '913b86d7d9cfd0b9ef4c3ba7d006e4bb330da475415a0186bf821227670d2afb', 'sharma.abhinav@akamai.com', '2015-01-28 15:17:29', '8e143c2583eaeff42dc7daac4e190508906e5ec5f38f3f0bd1abf40efa8b7b90', 'Abhinav Sharma', NULL)
SELECT * FROM "users" ORDER BY users.id DESC LIMIT 1
INSERT INTO "phonebooks" ("updated_at", "name", "user_id", "created_at") VALUES('2015-02-03 08:38:25', 'pranav prashant''s Phonebook', 31, '2015-02-03 08:38:25')